/**
* Файл package-info.java описывает содержимое пакета ru.job4j.start.
* Класс Item описывает содержимое заявок.
* Класс Tracker оболочка над массивом заявок, реализует операции по обработке заявок.
* Класс StartUI - основа программы, реализует диалог с пользователем и работу меню.
* Интерфейс Input определяет метод ask для ввода данных в приложение.
* Класс StubInput реализует интерфейс Input в качестве эмулятора пользователя.
* Класс ConsoleInput реализует интерфейс Input, возвращает данные, введенные пользователем в консоли.
* Интерфейс UserAction описывает основные действия меню(добавление, удаление, поиск и т.д.).
* Класс MenuTracker реализует диалог с пользователем, выполняет действия над заявками.
* @author Konstantin Kolganov (kkolganov.92@gmail.com)
* @since 16.09.2017
* @version 2.0
*/

package ru.job4j.start;